---
kind: type
id: T:Autodesk.Revit.DB.GridType
source: html/f53d7c74-a843-4bdb-b9d9-584b7abbf668.htm
---
# Autodesk.Revit.DB.GridType

An object that represents a grid type.

## Syntax (C#)
```csharp
public class GridType : LineAndTextAttrSymbol
```